Revit 2024 API
ParameterFilterRuleFactory.CreateEqualsRule Method (ElementId, String, Boolean)
 Creates a filter rule that determines whether strings from the document equal a certain value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a future version of Revit. Please use the constructor without the `caseSensitive` argument instead.")]
public static FilterRule CreateEqualsRule(
	ElementId parameter,
	string value,
	bool caseSensitive
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a future version of Revit. Please use the constructor without the `caseSensitive` argument instead.")> _
Public Shared Function CreateEqualsRule ( _
	parameter As ElementId, _
	value As String, _
	caseSensitive As Boolean _
) As FilterRule
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2023 and may be removed in a future version of Revit. Please use the constructor without the `caseSensitive` argument instead.")]
public:
static FilterRule^ CreateEqualsRule(
	ElementId^ parameter,
	String^ value,
	bool caseSensitive
)
Parameters
parameter
Type: Autodesk.Revit.DB.ElementId
 A string-typed parameter used to get values from the document for a given element.
value
Type: System.String
 The user-supplied string value against which values from the document will be compared.
caseSensitive
Type: System.Boolean
 If true, the string comparison will be case-sensitive.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ParameterFilterRuleFactory Class
CreateEqualsRule Overload
Autodesk.Revit.DB Namespace